[
  {
    "id": "seed-001",
    "title": "Airstrike targets military compound in eastern Tehran",
    "location": "Tehran",
    "latitude": 35.6892,
    "longitude": 51.389,
    "date": "2026-02-15",
    "killed": 45,
    "wounded": 120,
    "notable_figures": ["General Abbas Nilforoushan"],
    "description": "A coordinated airstrike hit a military compound in eastern Tehran early morning, causing significant casualties among IRGC personnel stationed at the facility. Emergency services were overwhelmed as secondary explosions rocked the area for hours after the initial strike.",
    "source": "Reuters",
    "source_url": "https://reuters.com/world/middle-east/"
  },
  {
    "id": "seed-002",
    "title": "Missile strikes near Isfahan nuclear facility",
    "location": "Isfahan",
    "latitude": 32.6546,
    "longitude": 51.668,
    "date": "2026-02-18",
    "killed": 23,
    "wounded": 67,
    "notable_figures": [],
    "description": "Multiple missile strikes targeted areas surrounding the Isfahan nuclear research facility. While the main reactor complex appeared undamaged, nearby military barracks and support infrastructure suffered direct hits. Radiation monitoring teams were deployed as a precaution.",
    "source": "Al Jazeera",
    "source_url": "https://aljazeera.com/where/iran/"
  },
  {
    "id": "seed-003",
    "title": "Overnight bombing campaign hits industrial district in Tabriz",
    "location": "Tabriz",
    "latitude": 38.08,
    "longitude": 46.2919,
    "date": "2026-02-19",
    "killed": 12,
    "wounded": 34,
    "notable_figures": [],
    "description": "An overnight bombing campaign targeted the industrial zone of Tabriz, destroying several manufacturing plants believed to be producing military equipment. Civilian casualties were reported in adjacent residential neighborhoods.",
    "source": "BBC News",
    "source_url": "https://bbc.com/news/topics/cwlw3xz047jt"
  },
  {
    "id": "seed-004",
    "title": "Coastal defense installations struck near Bushehr port",
    "location": "Bushehr",
    "latitude": 28.9234,
    "longitude": 50.8203,
    "date": "2026-02-20",
    "killed": 8,
    "wounded": 15,
    "notable_figures": [],
    "description": "Precision strikes hit coastal defense batteries and radar installations near the strategic port of Bushehr. The nuclear power plant, located nearby, was reportedly not targeted. Naval assets in the harbor sustained damage.",
    "source": "AP News",
    "source_url": "https://apnews.com/hub/iran"
  },
  {
    "id": "seed-005",
    "title": "Major airstrike on IRGC headquarters in Shiraz kills dozens",
    "location": "Shiraz",
    "latitude": 29.5918,
    "longitude": 52.5837,
    "date": "2026-02-21",
    "killed": 67,
    "wounded": 200,
    "notable_figures": ["Deputy Commander Reza Mousavi", "Brigadier General Hossein Salami"],
    "description": "The deadliest single strike of the conflict so far devastated the IRGC Southern Command headquarters in Shiraz. Among the dead were senior military officials who were reportedly meeting to coordinate regional defense operations. The blast left a massive crater visible from satellite imagery.",
    "source": "CNN",
    "source_url": "https://edition.cnn.com/middleeast"
  },
  {
    "id": "seed-006",
    "title": "Precision strikes target uranium enrichment facility at Natanz",
    "location": "Natanz",
    "latitude": 33.5131,
    "longitude": 51.9164,
    "date": "2026-02-22",
    "killed": 5,
    "wounded": 22,
    "notable_figures": [],
    "description": "Bunker-buster munitions penetrated underground centrifuge halls at the Natanz enrichment complex. Iranian authorities reported minimal casualties but acknowledged significant damage to enrichment cascades. International atomic inspectors requested emergency access.",
    "source": "Reuters",
    "source_url": "https://reuters.com/world/middle-east/"
  },
  {
    "id": "seed-007",
    "title": "Carpet bombing devastates military airfield near Kermanshah",
    "location": "Kermanshah",
    "latitude": 34.3142,
    "longitude": 47.065,
    "date": "2026-02-23",
    "killed": 31,
    "wounded": 89,
    "notable_figures": [],
    "description": "A sustained bombing campaign destroyed the main military airfield serving western Iran near Kermanshah. Dozens of aircraft were destroyed on the ground, along with hangars, fuel depots, and command facilities. Fires burned for over 12 hours after the attack.",
    "source": "Al Jazeera",
    "source_url": "https://aljazeera.com/where/iran/"
  },
  {
    "id": "seed-008",
    "title": "Naval base at Bandar Abbas struck in coordinated attack",
    "location": "Bandar Abbas",
    "latitude": 27.1865,
    "longitude": 56.2808,
    "date": "2026-02-24",
    "killed": 19,
    "wounded": 43,
    "notable_figures": ["Admiral Alireza Tangsiri"],
    "description": "A coordinated sea and air assault targeted the main Iranian naval base at Bandar Abbas, gateway to the Strait of Hormuz. Multiple warships were damaged at their berths. The attack raised fears of disruption to global oil shipping routes through the strategic waterway.",
    "source": "BBC News",
    "source_url": "https://bbc.com/news/topics/cwlw3xz047jt"
  },
  {
    "id": "seed-009",
    "title": "Drone strike hits Revolutionary Guard training camp in Mashhad",
    "location": "Mashhad",
    "latitude": 36.2605,
    "longitude": 59.6168,
    "date": "2026-02-25",
    "killed": 38,
    "wounded": 71,
    "notable_figures": [],
    "description": "A wave of armed drones struck an IRGC training facility on the outskirts of Mashhad, Iran's second-largest city. The attack occurred during a training exercise, resulting in high casualties among new recruits. Nearby residential areas reported broken windows and minor damage.",
    "source": "AP News",
    "source_url": "https://apnews.com/hub/iran"
  },
  {
    "id": "seed-010",
    "title": "Missile barrage targets air defense network near Ahvaz",
    "location": "Ahvaz",
    "latitude": 31.3183,
    "longitude": 48.6706,
    "date": "2026-02-25",
    "killed": 14,
    "wounded": 28,
    "notable_figures": [],
    "description": "A systematic missile barrage destroyed multiple S-300 air defense batteries protecting the oil-rich Khuzestan province capital of Ahvaz. The strike is believed to have been aimed at creating corridors for future aerial operations in the region.",
    "source": "Reuters",
    "source_url": "https://reuters.com/world/middle-east/"
  },
  {
    "id": "seed-011",
    "title": "Explosion rocks Parchin military complex south of Tehran",
    "location": "Parchin",
    "latitude": 35.52,
    "longitude": 51.77,
    "date": "2026-02-26",
    "killed": 9,
    "wounded": 35,
    "notable_figures": [],
    "description": "A massive explosion was reported at the Parchin military complex, long suspected of housing weapons development programs. Satellite images showed large sections of the facility completely destroyed. Iranian officials blamed an airstrike while investigators could not confirm the cause.",
    "source": "CNN",
    "source_url": "https://edition.cnn.com/middleeast"
  },
  {
    "id": "seed-012",
    "title": "Strategic bridge bombing disrupts supply lines near Dezful",
    "location": "Dezful",
    "latitude": 32.3814,
    "longitude": 48.4016,
    "date": "2026-02-27",
    "killed": 3,
    "wounded": 11,
    "notable_figures": [],
    "description": "Precision strikes destroyed three major bridges over the Dez River near Dezful, severing key military supply lines between western Iran and the interior. The attacks also damaged nearby fuel storage facilities, creating massive fires visible for kilometers.",
    "source": "Al Jazeera",
    "source_url": "https://aljazeera.com/where/iran/"
  },
  {
    "id": "seed-013",
    "title": "Underground missile facility at Fordow struck by bunker busters",
    "location": "Fordow",
    "latitude": 34.7089,
    "longitude": 51.0375,
    "date": "2026-02-27",
    "killed": 7,
    "wounded": 18,
    "notable_figures": [],
    "description": "Deep-penetrating munitions targeted the hardened underground facility at Fordow, built inside a mountain to withstand conventional attacks. While the full extent of damage remained unclear, seismic sensors detected multiple underground detonations consistent with successful penetration.",
    "source": "BBC News",
    "source_url": "https://bbc.com/news/topics/cwlw3xz047jt"
  },
  {
    "id": "seed-014",
    "title": "Communications hub destroyed in Qom sparks blackout",
    "location": "Qom",
    "latitude": 34.6401,
    "longitude": 50.8764,
    "date": "2026-02-28",
    "killed": 6,
    "wounded": 19,
    "notable_figures": [],
    "description": "Strikes on a major military communications center in the holy city of Qom disrupted command and control networks across central Iran. The attack caused widespread power outages affecting both military and civilian infrastructure in the surrounding province.",
    "source": "AP News",
    "source_url": "https://apnews.com/hub/iran"
  },
  {
    "id": "seed-015",
    "title": "Karaj military depot explosion sends shockwaves through suburbs",
    "location": "Karaj",
    "latitude": 35.84,
    "longitude": 50.9391,
    "date": "2026-02-28",
    "killed": 16,
    "wounded": 52,
    "notable_figures": ["Colonel Mahmoud Karimi"],
    "description": "A weapons storage facility on the outskirts of Karaj, west of Tehran, suffered a catastrophic detonation following an airstrike. The resulting explosion and fire spread to adjacent ammunition bunkers, creating a chain reaction that lasted hours and shattered windows across the suburban area.",
    "source": "Reuters",
    "source_url": "https://reuters.com/world/middle-east/"
  }
]
