[
  {
    "id": "feb26-001",
    "title": "Israeli F-35s strike Parchin military complex in predawn raid",
    "location": "Parchin",
    "latitude": 35.52,
    "longitude": 51.77,
    "date": "2026-02-26T03:15:00Z",
    "killed": 34,
    "wounded": 87,
    "notable_figures": [],
    "description": "Israeli Air Force F-35I Adir stealth fighters launched a coordinated predawn strike on the Parchin military complex south of Tehran. Multiple bunker-buster munitions penetrated underground facilities long suspected of housing weapons development programs. Satellite imagery showed massive craters and secondary explosions continuing hours after the initial strike.",
    "source": "Reuters",
    "source_url": "https://reuters.com/world/middle-east/",
    "attacker": "Israel",
    "origin_location": "Nevatim AFB, Israel",
    "origin_latitude": 31.2083,
    "origin_longitude": 34.6667
  },
  {
    "id": "feb26-002",
    "title": "US cruise missiles devastate Isfahan nuclear research facility",
    "location": "Isfahan",
    "latitude": 32.6546,
    "longitude": 51.668,
    "date": "2026-02-26T03:22:00Z",
    "killed": 19,
    "wounded": 62,
    "notable_figures": [],
    "description": "A barrage of Tomahawk cruise missiles launched from US Navy vessels in the Gulf of Oman struck the Isfahan nuclear research complex. The precision strikes targeted centrifuge assembly buildings and heavy water production facilities. International atomic inspectors reported significant damage to key infrastructure.",
    "source": "AP News",
    "source_url": "https://apnews.com/hub/iran",
    "attacker": "USA",
    "origin_location": "USS Eisenhower, Gulf of Oman",
    "origin_latitude": 25.5,
    "origin_longitude": 57.0
  },
  {
    "id": "feb26-003",
    "title": "Israeli long-range strike hits IRGC command center in Tehran",
    "location": "Tehran",
    "latitude": 35.6892,
    "longitude": 51.389,
    "date": "2026-02-26T03:30:00Z",
    "killed": 52,
    "wounded": 145,
    "notable_figures": ["General Mohammad Bagheri", "Brigadier General Amir Ali Hajizadeh"],
    "description": "Israeli precision-guided munitions struck the IRGC Aerospace Force headquarters in eastern Tehran during an emergency command meeting. The strike killed senior military leadership and destroyed the facility's underground command bunker. Shockwaves shattered windows across a 3km radius. Rescue operations were hampered by secondary detonations from stored ordnance.",
    "source": "Al Jazeera",
    "source_url": "https://aljazeera.com/where/iran/",
    "attacker": "Israel",
    "origin_location": "Nevatim AFB, Israel",
    "origin_latitude": 31.2083,
    "origin_longitude": 34.6667
  },
  {
    "id": "feb26-004",
    "title": "US Navy strikes destroy Natanz enrichment cascades",
    "location": "Natanz",
    "latitude": 33.5131,
    "longitude": 51.9164,
    "date": "2026-02-26T03:45:00Z",
    "killed": 8,
    "wounded": 31,
    "notable_figures": [],
    "description": "GBU-57 Massive Ordnance Penetrator munitions delivered by B-2 Spirit bombers penetrated the deeply buried centrifuge halls at Natanz. Seismic monitoring stations across the region detected the underground detonations. Iran's Atomic Energy Organization confirmed catastrophic damage to advanced centrifuge arrays, setting back enrichment capabilities significantly.",
    "source": "BBC News",
    "source_url": "https://bbc.com/news/topics/cwlw3xz047jt",
    "attacker": "USA",
    "origin_location": "Al Udeid Air Base, Qatar",
    "origin_latitude": 25.1171,
    "origin_longitude": 51.315
  },
  {
    "id": "feb26-005",
    "title": "Coordinated US carrier strike cripples Bandar Abbas naval base",
    "location": "Bandar Abbas",
    "latitude": 27.1865,
    "longitude": 56.2808,
    "date": "2026-02-26T04:00:00Z",
    "killed": 23,
    "wounded": 56,
    "notable_figures": ["Admiral Alireza Tangsiri"],
    "description": "Carrier-based F/A-18 Super Hornets from the USS Eisenhower strike group launched a devastating attack on Iran's largest naval base at Bandar Abbas. Multiple IRGC Navy fast attack craft, a frigate, and two missile corvettes were destroyed at their berths. Port infrastructure and submarine pens sustained direct hits, effectively closing the base.",
    "source": "CNN",
    "source_url": "https://edition.cnn.com/middleeast",
    "attacker": "USA",
    "origin_location": "USS Eisenhower, Gulf of Oman",
    "origin_latitude": 25.5,
    "origin_longitude": 57.0
  },
  {
    "id": "feb26-006",
    "title": "Israeli bunker busters target Fordow underground facility",
    "location": "Fordow",
    "latitude": 34.7089,
    "longitude": 51.0375,
    "date": "2026-02-26T04:10:00Z",
    "killed": 6,
    "wounded": 22,
    "notable_figures": [],
    "description": "The hardened underground enrichment facility at Fordow, built deep inside a mountain, was targeted by a salvo of Israeli-delivered GBU-28 bunker busters. While full penetration of the deepest chambers remained uncertain, access tunnels and ventilation systems were destroyed, effectively sealing the facility. Radiation monitoring teams were deployed as a precaution.",
    "source": "Reuters",
    "source_url": "https://reuters.com/world/middle-east/",
    "attacker": "Israel",
    "origin_location": "Nevatim AFB, Israel",
    "origin_latitude": 31.2083,
    "origin_longitude": 34.6667
  },
  {
    "id": "feb26-007",
    "title": "Iran launches massive ballistic missile barrage on Tel Aviv",
    "location": "Tel Aviv",
    "latitude": 32.0853,
    "longitude": 34.7818,
    "date": "2026-02-26T14:30:00Z",
    "killed": 41,
    "wounded": 189,
    "notable_figures": [],
    "description": "In the largest retaliatory strike in the conflict, Iran's IRGC Aerospace Force launched over 100 Emad and Ghadr-110 ballistic missiles toward Tel Aviv. While Israel's multi-layered Iron Dome, David's Sling, and Arrow defense systems intercepted the majority, several missiles penetrated, striking the Azrieli Center district and the coastal promenade. Emergency services reported widespread destruction across multiple city blocks.",
    "source": "Al Jazeera",
    "source_url": "https://aljazeera.com/where/iran/",
    "attacker": "Iran",
    "origin_location": "Kermanshah, Iran",
    "origin_latitude": 34.3142,
    "origin_longitude": 47.065
  },
  {
    "id": "feb26-008",
    "title": "Iranian cruise missiles strike Haifa port and refinery complex",
    "location": "Haifa",
    "latitude": 32.794,
    "longitude": 34.9896,
    "date": "2026-02-26T14:45:00Z",
    "killed": 28,
    "wounded": 112,
    "notable_figures": [],
    "description": "Soumar cruise missiles launched from northwestern Iran struck the strategic port city of Haifa. Direct hits on the oil refinery complex triggered massive fires visible from space, while the port's container terminal sustained significant structural damage. The attack disrupted Mediterranean shipping operations and forced evacuation of surrounding neighborhoods.",
    "source": "BBC News",
    "source_url": "https://bbc.com/news/topics/cwlw3xz047jt",
    "attacker": "Iran",
    "origin_location": "Tabriz, Iran",
    "origin_latitude": 38.08,
    "origin_longitude": 46.2919
  },
  {
    "id": "feb26-009",
    "title": "Shahab-3 missiles rain down on Nevatim Air Base",
    "location": "Nevatim AFB",
    "latitude": 31.2083,
    "longitude": 34.6667,
    "date": "2026-02-26T15:00:00Z",
    "killed": 15,
    "wounded": 43,
    "notable_figures": [],
    "description": "Iran targeted the same Israeli air base from which F-35 strikes had been launched hours earlier. A salvo of Shahab-3 medium-range ballistic missiles struck runways, hardened aircraft shelters, and fuel storage at Nevatim. Israeli Air Force confirmed damage to ground infrastructure but stated operational capability was maintained through dispersal to secondary bases.",
    "source": "Reuters",
    "source_url": "https://reuters.com/world/middle-east/",
    "attacker": "Iran",
    "origin_location": "Isfahan, Iran",
    "origin_latitude": 32.6546,
    "origin_longitude": 51.668
  },
  {
    "id": "feb26-010",
    "title": "Iranian missiles devastate Al Asad Air Base in Iraq",
    "location": "Al Asad Air Base",
    "latitude": 33.7856,
    "longitude": 42.4411,
    "date": "2026-02-26T15:20:00Z",
    "killed": 18,
    "wounded": 67,
    "notable_figures": [],
    "description": "Iran's IRGC launched a concentrated Fateh-110 tactical ballistic missile barrage against the US-operated Al Asad Air Base in western Iraq. The strikes hit troop housing, the flight line, and air defense positions. It was the deadliest attack on US forces in Iraq since the 2020 strikes, prompting immediate CENTCOM response protocols.",
    "source": "AP News",
    "source_url": "https://apnews.com/hub/iran",
    "attacker": "Iran",
    "origin_location": "Kermanshah, Iran",
    "origin_latitude": 34.3142,
    "origin_longitude": 47.065
  },
  {
    "id": "feb26-011",
    "title": "Ballistic missiles target Dimona nuclear facility in Negev",
    "location": "Dimona",
    "latitude": 31.07,
    "longitude": 35.21,
    "date": "2026-02-26T15:35:00Z",
    "killed": 7,
    "wounded": 25,
    "notable_figures": [],
    "description": "In a symbolic escalation, Iran launched Emad missiles toward Israel's Dimona nuclear research center in the Negev desert. Israel's Arrow-3 exoatmospheric interceptors engaged most incoming missiles at high altitude, but debris and at least two warheads impacted the facility's perimeter. Israel confirmed no breach of the reactor containment structure but acknowledged damage to support buildings.",
    "source": "CNN",
    "source_url": "https://edition.cnn.com/middleeast",
    "attacker": "Iran",
    "origin_location": "Shiraz, Iran",
    "origin_latitude": 29.5918,
    "origin_longitude": 52.5837
  },
  {
    "id": "feb26-012",
    "title": "Iranian drone and missile swarm hits Al Udeid Air Base, Qatar",
    "location": "Al Udeid Air Base",
    "latitude": 25.1171,
    "longitude": 51.315,
    "date": "2026-02-26T16:00:00Z",
    "killed": 12,
    "wounded": 48,
    "notable_figures": [],
    "description": "A combined swarm of Shahed-136 kamikaze drones and Dezful medium-range missiles targeted the US forward headquarters at Al Udeid Air Base in Qatar. CENTCOM's Combined Air Operations Center sustained partial damage, disrupting coordination of coalition air operations over the region. Patriot batteries intercepted most incoming threats but were overwhelmed by the volume of the attack.",
    "source": "Al Jazeera",
    "source_url": "https://aljazeera.com/where/iran/",
    "attacker": "Iran",
    "origin_location": "Bushehr, Iran",
    "origin_latitude": 28.9234,
    "origin_longitude": 50.8203
  }
]
